app/controllers/posts_controller.rb

	def create
	  @post = Post.new(post_params)
	  @post.save
---
INSERT INTO "posts" ("title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Testing "], ["description", "Blog Posts "], ["created_at", "2019-09-19 09:31:50.489909"], ["updated_at", "2019-09-19 09:31:50.489909"]]